<a href="https://colab.research.google.com/github/VeenusDadri/training/blob/master/advance_python/Dataframeoperations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
import os

In [12]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("pyspark operation").getOrCreate()

In [14]:
print(os.path.exists("/employees.csv"))

True

In [16]:
emp_df=spark.read.csv("/employees.csv",header=True,inferSchema=True)
emp_df.printSchema()

root
 |-- Employee ID: integer (nullable = true)
 |-- Store ID: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Position: string (nullable = true)

In [17]:
print("Initial Dataframe:")
emp_df.show(15)

Initial Dataframe:
+-----------+--------+--------------------+-----------------+
|Employee ID|Store ID|                Name|         Position|
+-----------+--------+--------------------+-----------------+
|          1|       1|     Stephen Johnson|    Store Manager|
|          2|       1|       Rebecca Myers|Assistant Manager|
|          3|       1|  Katherine Buchanan|          Cashier|
|          4|       1|       Jessica Hicks|      Stock Clerk|
|          5|       1|          Ryan Gross|  Sales Associate|
|          6|       1|     Jeffery Carlson|  Sales Associate|
|          7|       1|      Melissa Wilson|  Sales Associate|
|          8|       1|        Edward Hicks|  Sales Associate|
|          9|       1|        Shari Jordan|  Sales Associate|
|         10|       1|Mrs. Melissa Cald...|  Sales Associate|
|         11|       1|       Regina Nelson|  Sales Associate|
|         12|       1|        Kevin Dawson|  Sales Associate|
|         13|       1|       Nicole Murphy|  Sales Associate|
|         14|       2|         Susan Brown|    Store Manager|
|         15|       2|         Sean Miller|Assistant Manager|
+-----------+--------+--------------------+-----------------+
only showing top 15 rows

In [20]:
emp_df.count()

404

In [21]:
emp_df.collect()

[Row(Employee ID=1, Store ID=1, Name='Stephen Johnson', Position='Store Manager'),
 Row(Employee ID=2, Store ID=1, Name='Rebecca Myers', Position='Assistant Manager'),
 Row(Employee ID=3, Store ID=1, Name='Katherine Buchanan', Position='Cashier'),
 Row(Employee ID=4, Store ID=1, Name='Jessica Hicks', Position='Stock Clerk'),
 Row(Employee ID=5, Store ID=1, Name='Ryan Gross', Position='Sales Associate'),
 Row(Employee ID=6, Store ID=1, Name='Jeffery Carlson', Position='Sales Associate'),
 Row(Employee ID=7, Store ID=1, Name='Melissa Wilson', Position='Sales Associate'),
 Row(Employee ID=8, Store ID=1, Name='Edward Hicks', Position='Sales Associate'),
 Row(Employee ID=9, Store ID=1, Name='Shari Jordan', Position='Sales Associate'),
 Row(Employee ID=10, Store ID=1, Name='Mrs. Melissa Caldwell DDS', Position='Sales Associate'),
 Row(Employee ID=11, Store ID=1, Name='Regina Nelson', Position='Sales Associate'),
 Row(Employee ID=12, Store ID=1, Name='Kevin Dawson', Position='Sales Associate'),
 Row(Employee ID=13, Store ID=1, Name='Nicole Murphy', Position='Sales Associate'),
 Row(Employee ID=14, Store ID=2, Name='Susan Brown', Position='Store Manager'),
 Row(Employee ID=15, Store ID=2, Name='Sean Miller', Position='Assistant Manager'),
 Row(Employee ID=16, Store ID=2, Name='Christopher Dominguez', Position='Cashier'),
 Row(Employee ID=17, Store ID=2, Name='Lisa Mason', Position='Stock Clerk'),
 Row(Employee ID=18, Store ID=2, Name='David Pitts', Position='Sales Associate'),
 Row(Employee ID=19, Store ID=2, Name='Lance Schultz', Position='Sales Associate'),
 Row(Employee ID=20, Store ID=2, Name='Caroline Hall', Position='Sales Associate'),
 Row(Employee ID=21, Store ID=2, Name='Heather Wilson', Position='Sales Associate'),
 Row(Employee ID=22, Store ID=2, Name='Allison Young', Position='Sales Associate'),
 Row(Employee ID=23, Store ID=2, Name='Kathleen Thomas', Position='Sales Associate'),
 Row(Employee ID=24, Store ID=2, Name='Carl Walters', Position='Sales Associate'),
 Row(Employee ID=25, Store ID=3, Name='Kevin Douglas', Position='Store Manager'),
 Row(Employee ID=26, Store ID=3, Name='Stephanie Larson', Position='Assistant Manager'),
 Row(Employee ID=27, Store ID=3, Name='Andrew Thompson', Position='Cashier'),
 Row(Employee ID=28, Store ID=3, Name='Erica Davis', Position='Stock Clerk'),
 Row(Employee ID=29, Store ID=3, Name='Cynthia Serrano', Position='Sales Associate'),
 Row(Employee ID=30, Store ID=3, Name='Brittany Gonzalez', Position='Sales Associate'),
 Row(Employee ID=31, Store ID=3, Name='Patrick Simmons', Position='Sales Associate'),
 Row(Employee ID=32, Store ID=3, Name='Jennifer Johnson', Position='Sales Associate'),
 Row(Employee ID=33, Store ID=3, Name='Lynn Torres', Position='Sales Associate'),
 Row(Employee ID=34, Store ID=3, Name='Adam Long', Position='Sales Associate'),
 Row(Employee ID=35, Store ID=3, Name='Christopher Willis', Position='Sales Associate'),
 Row(Employee ID=36, Store ID=3, Name='Zachary Leonard', Position='Sales Associate'),
 Row(Employee ID=37, Store ID=4, Name='Justin Johnson', Position='Store Manager'),
 Row(Employee ID=38, Store ID=4, Name='Michael Lewis', Position='Assistant Manager'),
 Row(Employee ID=39, Store ID=4, Name='Kevin Chapman', Position='Cashier'),
 Row(Employee ID=40, Store ID=4, Name='Christopher Garrett', Position='Stock Clerk'),
 Row(Employee ID=41, Store ID=4, Name='Jonathan Cooley', Position='Sales Associate'),
 Row(Employee ID=42, Store ID=4, Name='Christine Garner', Position='Sales Associate'),
 Row(Employee ID=43, Store ID=4, Name='Joshua Sharp', Position='Sales Associate'),
 Row(Employee ID=44, Store ID=4, Name='Laura Whitehead', Position='Sales Associate'),
 Row(Employee ID=45, Store ID=4, Name='Jeremy Wolfe', Position='Sales Associate'),
 Row(Employee ID=46, Store ID=4, Name='Denise Harmon', Position='Sales Associate'),
 Row(Employee ID=47, Store ID=4, Name='Allen Fischer', Position='Sales Associate'),
 Row(Employee ID=48, Store ID=4, Name='Robert Price', Position='Sales Associate'),
 Row(Employee ID=49, Store ID=4, Name='Victoria Parker', Position='Sales Associate'),
 Row(Employee ID=50, Store ID=5, Name='Brandon Allen', Position='Store Manager'),
 Row(Employee ID=51, Store ID=5, Name='Matthew Klein', Position='Assistant Manager'),
 Row(Employee ID=52, Store ID=5, Name='Richard Miller', Position='Cashier'),
 Row(Employee ID=53, Store ID=5, Name='Teresa Wise', Position='Stock Clerk'),
 Row(Employee ID=54, Store ID=5, Name='Ronald Shannon', Position='Sales Associate'),
 Row(Employee ID=55, Store ID=5, Name='Kayla Hernandez', Position='Sales Associate'),
 Row(Employee ID=56, Store ID=5, Name='Ariel Morse', Position='Sales Associate'),
 Row(Employee ID=57, Store ID=5, Name='Kevin Stevens', Position='Sales Associate'),
 Row(Employee ID=58, Store ID=5, Name='Austin Bonilla', Position='Sales Associate'),
 Row(Employee ID=59, Store ID=5, Name='Larry Gutierrez', Position='Sales Associate'),
 Row(Employee ID=60, Store ID=5, Name='John Garza', Position='Sales Associate'),
 Row(Employee ID=61, Store ID=5, Name='Ruth Smith', Position='Sales Associate'),
 Row(Employee ID=62, Store ID=6, Name='张婷', Position='Store Manager'),
 Row(Employee ID=63, Store ID=6, Name='唐宇', Position='Assistant Manager'),
 Row(Employee ID=64, Store ID=6, Name='谢芳', Position='Cashier'),
 Row(Employee ID=65, Store ID=6, Name='王坤', Position='Stock Clerk'),
 Row(Employee ID=66, Store ID=6, Name='莫凤英', Position='Sales Associate'),
 Row(Employee ID=67, Store ID=6, Name='农健', Position='Sales Associate'),
 Row(Employee ID=68, Store ID=6, Name='罗彬', Position='Sales Associate'),
 Row(Employee ID=69, Store ID=6, Name='梁欣', Position='Sales Associate'),
 Row(Employee ID=70, Store ID=6, Name='蒋坤', Position='Sales Associate'),
 Row(Employee ID=71, Store ID=6, Name='李淑英', Position='Sales Associate'),
 Row(Employee ID=72, Store ID=6, Name='黄想', Position='Sales Associate'),
 Row(Employee ID=73, Store ID=7, Name='李瑜', Position='Store Manager'),
 Row(Employee ID=74, Store ID=7, Name='陈帅', Position='Assistant Manager'),
 Row(Employee ID=75, Store ID=7, Name='欧玉', Position='Cashier'),
 Row(Employee ID=76, Store ID=7, Name='林涛', Position='Stock Clerk'),
 Row(Employee ID=77, Store ID=7, Name='孔桂香', Position='Sales Associate'),
 Row(Employee ID=78, Store ID=7, Name='杨琳', Position='Sales Associate'),
 Row(Employee ID=79, Store ID=7, Name='黄华', Position='Sales Associate'),
 Row(Employee ID=80, Store ID=7, Name='何兰英', Position='Sales Associate'),
 Row(Employee ID=81, Store ID=7, Name='张杰', Position='Sales Associate'),
 Row(Employee ID=82, Store ID=7, Name='应小红', Position='Sales Associate'),
 Row(Employee ID=83, Store ID=7, Name='林淑英', Position='Sales Associate'),
 Row(Employee ID=84, Store ID=7, Name='唐旭', Position='Sales Associate'),
 Row(Employee ID=85, Store ID=7, Name='刘宁', Position='Sales Associate'),
 Row(Employee ID=86, Store ID=8, Name='邱桂珍', Position='Store Manager'),
 Row(Employee ID=87, Store ID=8, Name='夏红霞', Position='Assistant Manager'),
 Row(Employee ID=88, Store ID=8, Name='胡秀云', Position='Cashier'),
 Row(Employee ID=89, Store ID=8, Name='刘建', Position='Stock Clerk'),
 Row(Employee ID=90, Store ID=8, Name='胡秀云', Position='Sales Associate'),
 Row(Employee ID=91, Store ID=8, Name='周秀兰', Position='Sales Associate'),
 Row(Employee ID=92, Store ID=8, Name='汤建华', Position='Sales Associate'),
 Row(Employee ID=93, Store ID=8, Name='夏艳', Position='Sales Associate'),
 Row(Employee ID=94, Store ID=8, Name='杨凤英', Position='Sales Associate'),
 Row(Employee ID=95, Store ID=8, Name='李建国', Position='Sales Associate'),
 Row(Employee ID=96, Store ID=8, Name='李玉兰', Position='Sales Associate'),
 Row(Employee ID=97, Store ID=8, Name='郑琳', Position='Sales Associate'),
 Row(Employee ID=98, Store ID=8, Name='郭海燕', Position='Sales Associate'),
 Row(Employee ID=99, Store ID=9, Name='王晨', Position='Store Manager'),
 Row(Employee ID=100, Store ID=9, Name='石春梅', Position='Assistant Manager'),
 Row(Employee ID=101, Store ID=9, Name='李帅', Position='Cashier'),
 Row(Employee ID=102, Store ID=9, Name='史荣', Position='Stock Clerk'),
 Row(Employee ID=103, Store ID=9, Name='陈淑英', Position='Sales Associate'),
 Row(Employee ID=104, Store ID=9, Name='刘宁', Position='Sales Associate'),
 Row(Employee ID=105, Store ID=9, Name='许冬梅', Position='Sales Associate'),
 Row(Employee ID=106, Store ID=9, Name='胡婷', Position='Sales Associate'),
 Row(Employee ID=107, Store ID=9, Name='易玉', Position='Sales Associate'),
 Row(Employee ID=108, Store ID=9, Name='林玉', Position='Sales Associate'),
 Row(Employee ID=109, Store ID=9, Name='詹淑华', Position='Sales Associate'),
 Row(Employee ID=110, Store ID=9, Name='岳金凤', Position='Sales Associate'),
 Row(Employee ID=111, Store ID=10, Name='苏萍', Position='Store Manager'),
 Row(Employee ID=112, Store ID=10, Name='吴建平', Position='Assistant Manager'),
 Row(Employee ID=113, Store ID=10, Name='余建华', Position='Cashier'),
 Row(Employee ID=114, Store ID=10, Name='冷成', Position='Stock Clerk'),
 Row(Employee ID=115, Store ID=10, Name='梁秀云', Position='Sales Associate'),
 Row(Employee ID=116, Store ID=10, Name='李玲', Position='Sales Associate'),
 Row(Employee ID=117, Store ID=10, Name='王柳', Position='Sales Associate'),
 Row(Employee ID=118, Store ID=10, Name='贾淑英', Position='Sales Associate'),
 Row(Employee ID=119, Store ID=10, Name='查帅', Position='Sales Associate'),
 Row(Employee ID=120, Store ID=10, Name='刘宁', Position='Sales Associate'),
 Row(Employee ID=121, Store ID=10, Name='刘阳', Position='Sales Associate'),
 Row(Employee ID=122, Store ID=10, Name='王建平', Position='Sales Associate'),
 Row(Employee ID=123, Store ID=10, Name='童淑英', Position='Sales Associate'),
 Row(Employee ID=124, Store ID=11, Name='Hansjoachim Nette-Bolnbach', Position='Store Manager'),
 Row(Employee ID=125, Store ID=11, Name='Drago Hornig', Position='Assistant Manager'),
 Row(Employee ID=126, Store ID=11, Name='Janusz Schmiedecke B.Sc.', Position='Cashier'),
 Row(Employee ID=127, Store ID=11, Name='Dr. Gilbert Trommler B.A.', Position='Stock Clerk'),
 Row(Employee ID=128, Store ID=11, Name='Desiree Warmer-Wähner', Position='Sales Associate'),
 Row(Employee ID=129, Store ID=11, Name='Reingard Jacobi Jäckel', Position='Sales Associate'),
 Row(Employee ID=130, Store ID=11, Name='Univ.Prof. Ditmar Scheuermann B.Eng.', Position='Sales Associate'),
 Row(Employee ID=131, Store ID=11, Name='Frieda Geisler', Position='Sales Associate'),
 Row(Employee ID=132, Store ID=11, Name='Herr Hellmut Kraus', Position='Sales Associate'),
 Row(Employee ID=133, Store ID=11, Name='Hannes Biggen', Position='Sales Associate'),
 Row(Employee ID=134, Store ID=11, Name='Meinhard Linke', Position='Sales Associate'),
 Row(Employee ID=135, Store ID=11, Name='Isabelle Hauffer', Position='Sales Associate'),
 Row(Employee ID=136, Store ID=12, Name='Sibel Siering-Ullmann', Position='Store Manager'),
 Row(Employee ID=137, Store ID=12, Name='Frau Annelise Blümel', Position='Assistant Manager'),
 Row(Employee ID=138, Store ID=12, Name='Dr. Tim Henschel', Position='Cashier'),
 Row(Employee ID=139, Store ID=12, Name='Gerta Blümel', Position='Stock Clerk'),
 Row(Employee ID=140, Store ID=12, Name='Dr. Diane Oestrovsky', Position='Sales Associate'),
 Row(Employee ID=141, Store ID=12, Name='Wanda Stumpf', Position='Sales Associate'),
 Row(Employee ID=142, Store ID=12, Name='Dagmar Dehmel-Kusch', Position='Sales Associate'),
 Row(Employee ID=143, Store ID=12, Name='Harold Preiß', Position='Sales Associate'),
 Row(Employee ID=144, Store ID=12, Name='Heike Römer', Position='Sales Associate'),
 Row(Employee ID=145, Store ID=12, Name='Elisa Junck B.Sc.', Position='Sales Associate'),
 Row(Employee ID=146, Store ID=12, Name='Dr. Anita Seifert MBA.', Position='Sales Associate'),
 Row(Employee ID=147, Store ID=12, Name='Pero Birnbaum B.A.', Position='Sales Associate'),
 Row(Employee ID=148, Store ID=12, Name='Ellen Etzler', Position='Sales Associate'),
 Row(Employee ID=149, Store ID=13, Name='Claas Kruschwitz-Wilms', Position='Store Manager'),
 Row(Employee ID=150, Store ID=13, Name='Selma Jessel', Position='Assistant Manager'),
 Row(Employee ID=151, Store ID=13, Name='Dr. Ekrem Trub', Position='Cashier'),
 Row(Employee ID=152, Store ID=13, Name='Denny Häring', Position='Stock Clerk'),
 Row(Employee ID=153, Store ID=13, Name='Valeri Gute', Position='Sales Associate'),
 Row(Employee ID=154, Store ID=13, Name='Gunnar Kambs', Position='Sales Associate'),
 Row(Employee ID=155, Store ID=13, Name='Stjepan Adler B.Eng.', Position='Sales Associate'),
 Row(Employee ID=156, Store ID=13, Name='Univ.Prof. Reinald Becker MBA.', Position='Sales Associate'),
 Row(Employee ID=157, Store ID=13, Name='Inka Etzold B.A.', Position='Sales Associate'),
 Row(Employee ID=158, Store ID=13, Name='Gülten Sauer B.Eng.', Position='Sales Associate'),
 Row(Employee ID=159, Store ID=13, Name='Rosina Albers', Position='Sales Associate'),
 Row(Employee ID=160, Store ID=13, Name='Kathleen Kobelt B.A.', Position='Sales Associate'),
 Row(Employee ID=161, Store ID=14, Name='Jaroslaw Gute-Schäfer', Position='Store Manager'),
 Row(Employee ID=162, Store ID=14, Name='Dr. Janus Hellwig MBA.', Position='Assistant Manager'),
 Row(Employee ID=163, Store ID=14, Name='Hanne Zimmer-Blümel', Position='Cashier'),
 Row(Employee ID=164, Store ID=14, Name='Ann-Kathrin Lindner-Preiß', Position='Stock Clerk'),
 Row(Employee ID=165, Store ID=14, Name='Dipl.-Ing. Andree Lindau B.A.', Position='Sales Associate'),
 Row(Employee ID=166, Store ID=14, Name='Tatjana Rudolph', Position='Sales Associate'),
 Row(Employee ID=167, Store ID=14, Name='Jenny Ritter', Position='Sales Associate'),
 Row(Employee ID=168, Store ID=14, Name='Maya Mangold B.Sc.', Position='Sales Associate'),
 Row(Employee ID=169, Store ID=14, Name='Bärbel Reising B.A.', Position='Sales Associate'),
 Row(Employee ID=170, Store ID=14, Name='Ing. Eckehard Stahr', Position='Sales Associate'),
 Row(Employee ID=171, Store ID=14, Name='Prof. Tilo Zirme B.A.', Position='Sales Associate'),
 Row(Employee ID=172, Store ID=15, Name='Hubertine Sager-Hamann', Position='Store Manager'),
 Row(Employee ID=173, Store ID=15, Name='Prof. Kata Lübs B.Sc.', Position='Assistant Manager'),
 Row(Employee ID=174, Store ID=15, Name='Vinko Weinhage', Position='Cashier'),
 Row(Employee ID=175, Store ID=15, Name='Univ.Prof. Samira Hamann B.Eng.', Position='Stock Clerk'),
 Row(Employee ID=176, Store ID=15, Name='Baptist Girschner', Position='Sales Associate'),
 Row(Employee ID=177, Store ID=15, Name='Aloisia Schlosser B.A.', Position='Sales Associate'),
 Row(Employee ID=178, Store ID=15, Name='Univ.Prof. Hans-Theo Möchlichen', Position='Sales Associate'),
 Row(Employee ID=179, Store ID=15, Name='Albin Henck MBA.', Position='Sales Associate'),
 Row(Employee ID=180, Store ID=15, Name='Dr. Friedrich-Wilhelm Linke MBA.', Position='Sales Associate'),
 Row(Employee ID=181, Store ID=15, Name='Rosl Budig', Position='Sales Associate'),
 Row(Employee ID=182, Store ID=15, Name='Miguel Junk', Position='Sales Associate'),
 Row(Employee ID=183, Store ID=15, Name='Jonas Rosemann', Position='Sales Associate'),
 Row(Employee ID=184, Store ID=15, Name='Helmut Paffrath', Position='Sales Associate'),
 Row(Employee ID=185, Store ID=16, Name='Jeff Wiggins', Position='Store Manager'),
 Row(Employee ID=186, Store ID=16, Name='Nancy Butler', Position='Assistant Manager'),
 Row(Employee ID=187, Store ID=16, Name='Kevin Fields', Position='Cashier'),
 Row(Employee ID=188, Store ID=16, Name='Jared Daniels', Position='Stock Clerk'),
 Row(Employee ID=189, Store ID=16, Name='Angela Chapman', Position='Sales Associate'),
 Row(Employee ID=190, Store ID=16, Name='Annette Morgan', Position='Sales Associate'),
 Row(Employee ID=191, Store ID=16, Name='Christina Mccarthy', Position='Sales Associate'),
 Row(Employee ID=192, Store ID=16, Name='Kristina Mitchell', Position='Sales Associate'),
 Row(Employee ID=193, Store ID=16, Name='Sylvia Austin', Position='Sales Associate'),
 Row(Employee ID=194, Store ID=16, Name='Brent Oneill', Position='Sales Associate'),
 Row(Employee ID=195, Store ID=17, Name='Robert Oliver', Position='Store Manager'),
 Row(Employee ID=196, Store ID=17, Name='Joshua Hansen', Position='Assistant Manager'),
 Row(Employee ID=197, Store ID=17, Name='Richard Parks', Position='Cashier'),
 Row(Employee ID=198, Store ID=17, Name='Kenneth Dunn', Position='Stock Clerk'),
 Row(Employee ID=199, Store ID=17, Name='Jonathan Ryan', Position='Sales Associate'),
 Row(Employee ID=200, Store ID=17, Name='Mary Lee', Position='Sales Associate'),
 Row(Employee ID=201, Store ID=17, Name='Adam Lopez', Position='Sales Associate'),
 Row(Employee ID=202, Store ID=17, Name='Laura Bradley', Position='Sales Associate'),
 Row(Employee ID=203, Store ID=17, Name='Laura Baldwin', Position='Sales Associate'),
 Row(Employee ID=204, Store ID=17, Name='Karla Rasmussen', Position='Sales Associate'),
 Row(Employee ID=205, Store ID=17, Name='Michael Valenzuela', Position='Sales Associate'),
 Row(Employee ID=206, Store ID=17, Name='Paul Kemp', Position='Sales Associate'),
 Row(Employee ID=207, Store ID=18, Name='Cindy Anderson', Position='Store Manager'),
 Row(Employee ID=208, Store ID=18, Name='John Foley', Position='Assistant Manager'),
 Row(Employee ID=209, Store ID=18, Name='Anthony Sanders', Position='Cashier'),
 Row(Employee ID=210, Store ID=18, Name='Keith Small', Position='Stock Clerk'),
 Row(Employee ID=211, Store ID=18, Name='Lisa Jimenez', Position='Sales Associate'),
 Row(Employee ID=212, Store ID=18, Name='Allison Taylor', Position='Sales Associate'),
 Row(Employee ID=213, Store ID=18, Name='Jonathan Hill', Position='Sales Associate'),
 Row(Employee ID=214, Store ID=18, Name='Christina Cisneros', Position='Sales Associate'),
 Row(Employee ID=215, Store ID=18, Name='Sarah Moreno', Position='Sales Associate'),
 Row(Employee ID=216, Store ID=18, Name='Jake Moore', Position='Sales Associate'),
 Row(Employee ID=217, Store ID=19, Name='Wesley Hardin', Position='Store Manager'),
 Row(Employee ID=218, Store ID=19, Name='John Ray', Position='Assistant Manager'),
 Row(Employee ID=219, Store ID=19, Name='Kyle Black', Position='Cashier'),
 Row(Employee ID=220, Store ID=19, Name='Kelly Day', Position='Stock Clerk'),
 Row(Employee ID=221, Store ID=19, Name='Brenda Williams', Position='Sales Associate'),
 Row(Employee ID=222, Store ID=19, Name='Michael Gardner', Position='Sales Associate'),
 Row(Employee ID=223, Store ID=19, Name='Bob Hoffman', Position='Sales Associate'),
 Row(Employee ID=224, Store ID=19, Name='Nicole Rice', Position='Sales Associate'),
 Row(Employee ID=225, Store ID=19, Name='Maria Hunter', Position='Sales Associate'),
 Row(Employee ID=226, Store ID=19, Name='David Hartman', Position='Sales Associate'),
 Row(Employee ID=227, Store ID=19, Name='Cheyenne Mann', Position='Sales Associate'),
 Row(Employee ID=228, Store ID=19, Name='Monica Moran', Position='Sales Associate'),
 Row(Employee ID=229, Store ID=20, Name='John Greene', Position='Store Manager'),
 Row(Employee ID=230, Store ID=20, Name='Carol Cox', Position='Assistant Manager'),
 Row(Employee ID=231, Store ID=20, Name='John Bailey', Position='Cashier'),
 Row(Employee ID=232, Store ID=20, Name='Donald Griffin', Position='Stock Clerk'),
 Row(Employee ID=233, Store ID=20, Name='Michael Clayton', Position='Sales Associate'),
 Row(Employee ID=234, Store ID=20, Name='Austin Baker', Position='Sales Associate'),
 Row(Employee ID=235, Store ID=20, Name='Alexander Baker MD', Position='Sales Associate'),
 Row(Employee ID=236, Store ID=20, Name='Briana Moss', Position='Sales Associate'),
 Row(Employee ID=237, Store ID=20, Name='Sergio Hoover', Position='Sales Associate'),
 Row(Employee ID=238, Store ID=20, Name='Angela Turner', Position='Sales Associate'),
 Row(Employee ID=239, Store ID=21, Name='Alexandria Ribeiro', Position='Store Manager'),
 Row(Employee ID=240, Store ID=21, Name='Lucy Lebon de Grenier', Position='Assistant Manager'),
 Row(Employee ID=241, Store ID=21, Name='Henriette Pierre', Position='Cashier'),

In [22]:
selected_colums=emp_df.select("Employee ID","Store ID","Position")
print("Selected Columns:")
selected_colums.show(15)

Selected Columns:
+-----------+--------+-----------------+
|Employee ID|Store ID|         Position|
+-----------+--------+-----------------+
|          1|       1|    Store Manager|
|          2|       1|Assistant Manager|
|          3|       1|          Cashier|
|          4|       1|      Stock Clerk|
|          5|       1|  Sales Associate|
|          6|       1|  Sales Associate|
|          7|       1|  Sales Associate|
|          8|       1|  Sales Associate|
|          9|       1|  Sales Associate|
|         10|       1|  Sales Associate|
|         11|       1|  Sales Associate|
|         12|       1|  Sales Associate|
|         13|       1|  Sales Associate|
|         14|       2|    Store Manager|
|         15|       2|Assistant Manager|
+-----------+--------+-----------------+
only showing top 15 rows

In [23]:
filtered_df=emp_df.filter(emp_df["Store ID"]==2)
print("filtered Data:" ,filtered_df.count())
filtered_df.show()

filtered Data: 11
+-----------+--------+--------------------+-----------------+
|Employee ID|Store ID|                Name|         Position|
+-----------+--------+--------------------+-----------------+
|         14|       2|         Susan Brown|    Store Manager|
|         15|       2|         Sean Miller|Assistant Manager|
|         16|       2|Christopher Domin...|          Cashier|
|         17|       2|          Lisa Mason|      Stock Clerk|
|         18|       2|         David Pitts|  Sales Associate|
|         19|       2|       Lance Schultz|  Sales Associate|
|         20|       2|       Caroline Hall|  Sales Associate|
|         21|       2|      Heather Wilson|  Sales Associate|
|         22|       2|       Allison Young|  Sales Associate|
|         23|       2|     Kathleen Thomas|  Sales Associate|
|         24|       2|        Carl Walters|  Sales Associate|
+-----------+--------+--------------------+-----------------+

In [24]:
dropped_df=emp_df.drop("Name")
print("Dropped Data:",dropped_df.count())

Dropped Data: 404

In [25]:
dropped_df.show()

+-----------+--------+-----------------+
|Employee ID|Store ID|         Position|
+-----------+--------+-----------------+
|          1|       1|    Store Manager|
|          2|       1|Assistant Manager|
|          3|       1|          Cashier|
|          4|       1|      Stock Clerk|
|          5|       1|  Sales Associate|
|          6|       1|  Sales Associate|
|          7|       1|  Sales Associate|
|          8|       1|  Sales Associate|
|          9|       1|  Sales Associate|
|         10|       1|  Sales Associate|
|         11|       1|  Sales Associate|
|         12|       1|  Sales Associate|
|         13|       1|  Sales Associate|
|         14|       2|    Store Manager|
|         15|       2|Assistant Manager|
|         16|       2|          Cashier|
|         17|       2|      Stock Clerk|
|         18|       2|  Sales Associate|
|         19|       2|  Sales Associate|
|         20|       2|  Sales Associate|
+-----------+--------+-----------------+
only showing top 20 rows